{
    "modelTopology": {
      "keras_version": "2.2.4-tf",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "batch_input_shape": [null, 4], 
                "dtype": "float32",
                "units": 1,
                "activation": "linear", 
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        }
      },
      "training_config": {
        "loss": "mean_squared_error", 
        "metrics": [],
        "weighted_metrics": [],
        "loss_weights": null,
        "sample_weight_mode": null,
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "name": "Adam",
            "learning_rate": 0.001, 
            "decay": 0.0,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-07,
            "amsgrad": false
          }
        }
      }
    },
    "format": "layers-model"
  }
  